Revit 2027 API
IFCAnyHandle.Delete Method
 Deletes the handle.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Delete()
Public Sub Delete
public:
void Delete()
member Delete : unit -> unit
See Also
Reference
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace